/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**                                 http://www.zlgmcu.com
**-----------------------------------------------------------文件信息--------------------------------------------------------------------------------
**	文   件  	名:	CANAPP.H
** 	版  		本:	v1.0
** 	日		期:	2004年2月23日
**	描		述:	CAN模块应用接口函数定义头文件。
********************************************************************************************************/
#ifndef		_CANAPP_H_
#define		_CANAPP_H_
#ifndef		_CANAPP_GLOBAL_
#define		CANAPP_GLOBAL		extern
#else
#define		CANAPP_GLOBAL	
#endif

//应用常量定义
extern	const 	u32	USE_MOD_CAN[4];
extern	const	u32	USE_EWL_CAN[4];
extern	const 	u32	USE_INT_CAN[4];
extern	const 	u32	USE_TPM_CAN[4]; 
extern	const 	u32	USE_BTR_CAN[4]; 
extern	const 	u32	USE_SLP_MOD_CAN[4]; 

/*
***********************************************************************************************************
**函数原型	:  	u32	CANSendData(eCANNUM CanNum,u32 Cmd,P_stcTxBUF Buf)
**参数说明	:  	CanNum	-->>	CAN控制器，值不能大于CAN_MAX_NUM 规定的值
				Cmd		à>	发送命令字
				Buf		à>	要发送的数据
**返回值		:	无	
**说	明		:	本函数用于将数据发送到CAN总线
************************************************************************************************************/
CANAPP_GLOBAL	u32	CANSendData(eCANNUM CanNum,u32 Cmd,P_stcTxBUF Buf);
#endif
/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
