/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**                                 http://www.zlgmcu.com
**-----------------------------------------------------------文件信息--------------------------------------------------------------------------------
**	文   件  	名:	INCLUDECAN.H
** 	版  		本:	v1.0
** 	日		期:	2004年2月23日
**	描		述: 	统一引用CAN驱动部分所有的头文件(CANREG.H,CANIORAW.H,CANFUNC.H,CANAPP.H)。用户在
**				使用CAN驱动时只需引用该文件即可，便于用户使用。
********************************************************************************************************/
#ifndef	_INCLUDECAN_H_
#define	_INCLUDECAN_H_
/**********************************************************************************************************
**									文件引用
**********************************************************************************************************/
//#include	"DATATYPETRS.h"				//引用与编译器无关的数据类型转换文件
//#include 	"LPC22xx.H"					//引用微处理器LPCxxxx系列头文件
#include	"CUSTOM.h"					//引用用户配置文件
#include	"CANREG.h"					//引用硬件抽象层头文件CAN寄存器数据类型定义头文件
#include	"CANIORAW.h"				//引用硬件抽象层头文件CAN寄存器操作方法定义头文件
#include	"CANFUNC.h"					//引用功能函数定义头文件
#include	"CANAPP.h"					//引用用户接口函数定义头文件
#endif
/*********************************************************************************************************
**                            			End Of File
********************************************************************************************************/
